// RGB7170 - Давхрын хэд дэх хаалга
// Нэг орцтой байрны давхрын тоо, давхар дахь хаалганы тоо өгөгдөв. Айлын хаалганы дугаар мэдэгдэж байгаа үед тэрхүү айл хэд дэх давхрын хэд дэх хаалганд амьдардаг вэ? Давталт ашиглахгүй бодно.

// Input
//  Эхний мөрөнд давхрын тоо, давхар дахь хаалганы тоо зайгаар тусгаарлагдан өгөгдөнө.

// Хоёр дахь мөрөнд айлын хаалганы тоо өгөгдөнө.

// Output
// Давхрын тоо, давхар дахь хэд дэх хаалганы тоо зайгаар тусгаарлагдан хэвлэгдэнэ.

// Example
// Input:
// 5 4
// 10

// Output:
// 3 2
function findFloor(x, y) {
  function findDoor(n) {
    let floors = 0;
    let doors = 0;
    if (n <= x * y) {
      floors = n - (1 % y) + 1 - (x - (1 % y) + 1);
      doors = ((n - 1) % y) + 1;
    }
    console.log("Floor;", floors, "Door:", doors);
  }
  findDoor(10);
}
findFloor(5, 4);
